[{"content_title": "NASA Readies Perseverance Mars Rover's Earthly Twin ", "article_teaser_body": "Did you know NASA's next Mars rover has a nearly identical sibling on Earth for testing? Even better, it's about to roll for the first time through a replica Martian landscape."}, {"content_title": "Global Storms on Mars Launch Dust Towers Into the Sky", "article_teaser_body": "A Mars Dust Tower Stands Out Dust storms are common on Mars. But every decade or so, something unpredictable happens: a series of runaway storms break out, covering the entire planet in a dusty haze."}, {"content_title": "My Culture, My Voice", "article_teaser_body": "In honor of Hispanic Heritage Month, Christina Hernandez, an instrument engineer on the Mars 2020 mission, talks about her childhood and journey to NASA."}, {"content_title": "Media Get a Close-Up of NASA's Mars 2020 Rover", "article_teaser_body": "The clean room at NASA's Jet Propulsion Laboratory was open to the media to see NASA's next Mars explorer before it leaves for Florida in preparation for a summertime launch."}, {"content_title": "NASA Moves Forward With Campaign to Return Mars Samples to Earth", "article_teaser_body": "During this next phase, the program will mature critical technologies and make critical design decisions as well as assess industry partnerships."}, {"content_title": "NASA's Curiosity Rover Finds an Ancient Oasis on Mars", "article_teaser_body": "New evidence suggests salty, shallow ponds once dotted a Martian crater — a sign of the planet's drying climate."}, {"content_title": "NASA's Perseverance Rover Goes Through Trials by Fire, Ice, Light and Sound", "article_teaser_body": "The agency's new Mars rover is put through a series of tests in vacuum chambers, acoustic chambers and more to get ready for the Red Planet."}, {"content_title": "How NASA's Mars Helicopter Will Reach the Red Planet's Surface", "article_teaser_body": "The small craft will seek to prove that powered, controlled flight is possible on another planet. But just getting it onto the surface of Mars will take a whole lot of ingenuity."}, {"content_title": "Two Rovers to Roll on Mars Again: Curiosity and Mars 2020", "article_teaser_body": "They look like twins. But under the hood, the rover currently exploring the Red Planet and the one launching there this summer have distinct science tools and roles to play."}, {"content_title": "NASA's Perseverance Rover Attached to Atlas V Rocket", "article_teaser_body": "Ready for its launch later in the month, the Mars-bound rover will touch terra firma no more."}, {"content_title": "NASA's Perseverance Rover Is Midway to Mars ", "article_teaser_body": "Sometimes half measures can be a good thing – especially on a journey this long. The agency's latest rover only has about 146 million miles left to reach its destination."}, {"content_title": "NASA Mars Mission Connects With Bosnian and Herzegovinian Town", "article_teaser_body": "A letter from NASA was presented to the mayor of Jezero, Bosnia-Herzegovina, honoring the connection between the town and Jezero Crater, the Mars 2020 rover landing site."}, {"content_title": "Space History Is Made in This NASA Robot Factory", "article_teaser_body": "From rockets to rovers, JPL's Spacecraft Assembly Facility has been at the center of robotic spaceflight. Here's a closer look at what makes it so special."}, {"content_title": "From JPL's Mailroom to Mars and Beyond", "article_teaser_body": "Bill Allen has thrived as the mechanical systems design lead for three Mars rover missions, but he got his start as a teenager sorting letters for the NASA center."}, {"content_title": "Independent Review Indicates NASA Prepared for Mars Sample Return Campaign", "article_teaser_body": "NASA released an independent review report Tuesday indicating the agency is well positioned for its Mars Sample Return campaign to bring pristine samples from Mars to Earth for scientific study."}]